Revit 2026 API

# SweepPathSketch Property

---

The sketched path for the sweep.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Sketch PathSketch { get; }
```
```vb
Public ReadOnly Property PathSketch As Sketch
	Get
```
```cpp
public:
property Sketch^ PathSketch {
	Sketch^ get ();
}
```
```fsharp
member PathSketch : Sketch with get
```

#### Property Value

Sketch

If the sweep is based on selected 3d curves, this property is .

#### Reference

Sweep Class

Autodesk.Revit.DB Namespace